<?php require_once 'header.php'; ?>

<div class="container">
    <div class="page_title">
        <h1>О компании</h1>
    </div>
    <div class="company_wrap">
        <div class="sidebar_page">
            <ul class="sidebar_page_submenu">
                <li><a href="<?= PATH ?>page/company/">О компании</a></li>
                <li><a href="<?= PATH ?>page/partners/">Партнеры</a></li>
                <li><a href="<?= PATH ?>page/vacancy/">Вакансии</a></li>
                <li><a href="<?= PATH ?>page/requisites/">Реквизиты</a></li>
            </ul>
        </div>
        <div class="content_info">
            <div class="company__img">
                <img src="<?= PATH ?>views/img/apteka_zal_2.png" alt="Аптека Неболейка" title="Аптека Неболейка">
            </div>
            <div class="content_info_text">
                ООО "Аптека Неболейка" основана в 2007 году и входит в группу компаний ООО "Аптека Неболейка Плюс" и "Вита". Мы предлагаем своим покупателям широкий ассортимент лекарственных препаратов и товаров для красоты и здоровья. Предлагаемые в аптеках товары, закупаются исключительно у официальных дистрибьюторов, которые имеют все необходимые сертификаты и лицензии, что гарантирует высокое качество товаров и доступные цены.
            </div>
            <div class="content_info_red">
                Наш персонал – это высококвалифицированные специалисты – фармацевты и провизоры, которые в любой момент готовы оказать вам помощь в подборе препаратов.
            </div>
            <div class="content_info_quote">
                В нашей сети аптек постоянно проводятся акции, действуют скидки для льготной категории граждан, а также действует дисконтная программа для постоянных покупателей, распространяющаяся на все товары. В "Аптеке Неболейка" Вы найдете большой ассортимент лекарственных препаратов, медицинских товаров и техники, биологически активных добавок, средств личной гигиены, товаров для красоты и здоровья. Для Вашего удобства "Аптека Неболейка" работает круглосуточно. А также, у нас Вы можете сделать предварительный заказ необходимого Вам лекарства и забрать его в кратчайшие сроки.
            </div>
            <div class="content_info_sign">
                Генеральный директор сети аптек «Неболейка» <span>Войкин С.В.</span>
            </div>
        </div>
    </div>
</div>

<?php require_once 'footer.php'; ?>