<?php
ini_set('display_errors', 1); //для ошибок
error_reporting(E_ALL);
//defined("CATALOG") or die("Access denied!!!");
define("CATALOG", TRUE);
require_once '../config.php';
require_once 'functions.php';
// организация долгих скриптов https://php.ru/forum/threads/kak-organizovat-rabotu-dolgix-skriptov.48786/

//30.323360300064 мин.
$start = microtime(true);

auth();
//$ost_arr = ostByDate();
$ost_arr = ostByDate_file_get_contents_curl(); //получить все препараты
write_db_OstByDate_all($ost_arr); //записать все препараты
//$ost_arr = min_price_one_product($ost_arr);//обработать остатки, получить минимальные цены
//write_db_OstByDate($ost_arr);//записать минимальные цены
mail_import();

//adress_branches();

$finish = microtime(true);
$delta = $finish - $start;
echo '<hr>' . $delta . ' сек.';


/******************************************************************************
BranchId аптек, еще есть Id с маркировками

9117 Просвещения 20/25
9758 Луначарского 72
10964 Просвещения 24
11263 Композиторов 22
8863 Приладожский
9208 Луначаского 62

13826 Маркировка Приладожский д.23а
13845 Маркировка пр. Луначарского, д.72
13846 Маркировка Луначарского пр-т, д.62, кор.1
 */

/*
18458

	[branchId] => 9758
	[branch] => пр. Луначарского, д.72, корп.1, лит.А
	[address] => г. Санкт-Петербург, пр. Луначарского, д.72, корп. 1, лит. а, помещение 34 Н
	[branchId] => 13845
	[branch] => Маркировка пр. Луначарского, д.72, корп.1, лит.А
	[address] => пр. Луначарского, д.72, корп.1, лит.А

11797

    [branchId] => 9117
    [branch] => пр.Просвещения, д.20/25
    [address] => г.Санкт-Петербург, Просвещения пр., 20/25, лит. А, пом. 36 Н
    [branchId] => 10964
    [branch] => пр.Просвещения 24 к2
    [address] => г. Санкт-Петербург, пр.Просвещения 24 к2
    [branchId] => 11263
    [branch] => ул. Композиторов, 22, корп. 4
    [address] => г. Санкт-Петербург, ул. Композиторов, 22 корп. 4

10966

	все аптеки спразу

    [branchId] => 13826
    [branch] => Маркировка Приладожский д.23а
    [address] => Приладожский д.23а

    [branchId] => 13846
    [branch] => Маркировка Луначарского пр-т, д.62, кор.1
    [address] => Луначарского пр-т, д.62, кор.1

    [branchId] => 8824
    [branch] => п.Мурино ул.Оборонная д.2, пом.14 (не актив)
    [address] => п.Мурино ул.Оборонная д.2, пом.14

    [branchId] => 8863
    [branch] => Приладожский д.23а
    [address] => Приладожский д.23а

    [branchId] => 9208
    [branch] => Луначарского пр-т, д.62, кор.1
    [address] => Луначарского пр-т, д.62, кор.1

    [branchId] => 9117
    [branch] => пр.Просвещения, д.20/25
    [address] => г.Санкт-Петербург, Просвещения пр., 20/25, лит. А, пом. 36 Н

    [branchId] => 10964
    [branch] => пр.Просвещения 24 к2
    [address] => г. Санкт-Петербург, пр.Просвещения 24 к2

    [branchId] => 11263
    [branch] => ул. Композиторов, 22, корп. 4
    [address] => г. Санкт-Петербург, ул. Композиторов, 22 корп. 4

    [branchId] => 9758
    [branch] => пр. Луначарского, д.72, корп.1, лит.А
    [address] => г. Санкт-Петербург, пр. Луначарского, д.72, корп. 1, лит. а, помещение 34 Н

    [branchId] => 13845
    [branch] => Маркировка пр. Луначарского, д.72, корп.1, лит.А
    [address] => пр. Луначарского, д.72, корп.1, лит.А

	*/



/*

[0] => Array
                (
                    [branchId] => 8824
                    [branch] => п.Мурино ул.Оборонная д.2, пом.14 (не актив)
                    [address] => п.Мурино ул.Оборонная д.2, пом.14
                )

            [1] => Array
                (
                    [branchId] => 8863
                    [branch] => Приладожский д.23а
                    [address] => Приладожский д.23а
                )

            [2] => Array
                (
                    [branchId] => 9208
                    [branch] => Луначарского пр-т, д.62, кор.1
                    [address] => Луначарского пр-т, д.62, кор.1
                )

            [3] => Array
                (
                    [branchId] => 13826
                    [branch] => Маркировка Приладожский д.23а
                    [address] => Приладожский д.23а
                )

            [4] => Array
                (
                    [branchId] => 13846
                    [branch] => Маркировка Луначарского пр-т, д.62, кор.1
                    [address] => Луначарского пр-т, д.62, кор.1
                )

            [5] => Array
                (
                    [branchId] => 15837
                    [branch] => Маркировка пр.Просвещения, д.20/25
                    [address] => 
                )

            [6] => Array
                (
                    [branchId] => 15838
                    [branch] => Маркировка пр.Просвещения 24 к2
                    [address] => 
                )

            [7] => Array
                (
                    [branchId] => 15839
                    [branch] => Маркировка ул. Композиторов, 22, корп. 4
                    [address] => 
                )

            [8] => Array
                (
                    [branchId] => 9117
                    [branch] => пр.Просвещения, д.20/25
                    [address] => г.Санкт-Петербург, Просвещения пр., 20/25, лит. А, пом. 36 Н
                )

            [9] => Array
                (
                    [branchId] => 10964
                    [branch] => пр.Просвещения 24 к2
                    [address] => г. Санкт-Петербург, пр.Просвещения 24 к2
                )

            [10] => Array
                (
                    [branchId] => 11263
                    [branch] => ул. Композиторов, 22, корп. 4
                    [address] => г. Санкт-Петербург, ул. Композиторов, 22 корп. 4
                )

            [11] => Array
                (
                    [branchId] => 9758
                    [branch] => пр. Луначарского, д.72, корп.1, лит.А
                    [address] => г. Санкт-Петербург, пр. Луначарского, д.72, корп. 1, лит. а, помещение 34 Н
                )

            [12] => Array
                (
                    [branchId] => 13845
                    [branch] => Маркировка пр. Луначарского, д.72, корп.1, лит.А
                    [address] => пр. Луначарского, д.72, корп.1, лит.А
                )



*/